#!/usr/bin/env python
# set PYTHONPATH=C:\Users\v-yaohengpan\AppData\Local\Programs\Python\Python36-32\lib;
import codecs
str = input("try input")
print(str+"66")

# 文件
# file object = open(file_name [, access_mode][, buffering])
# r	以只读方式打开文件。文件的指针将会放在文件的开头。这是默认模式。
# rb	以二进制格式打开一个文件用于只读。文件指针将会放在文件的开头。这是默认模式。一般用于非文本文件如图片等。
# r+	打开一个文件用于读写。文件指针将会放在文件的开头。
# rb+	以二进制格式打开一个文件用于读写。文件指针将会放在文件的开头。一般用于非文本文件如图片等。
# w	打开一个文件只用于写入。如果该文件已存在则打开文件，并从开头开始编辑，即原有内容会被删除。如果该文件不存在，创建新文件。
# wb	以二进制格式打开一个文件只用于写入。如果该文件已存在则打开文件，并从开头开始编辑，即原有内容会被删除。如果该文件不存在，创建新文件。一般用于非文本文件如图片等。
# w+	打开一个文件用于读写。如果该文件已存在则打开文件，并从开头开始编辑，即原有内容会被删除。如果该文件不存在，创建新文件。
# wb+	以二进制格式打开一个文件用于读写。如果该文件已存在则打开文件，并从开头开始编辑，即原有内容会被删除。如果该文件不存在，创建新文件。一般用于非文本文件如图片等。
# a	打开一个文件用于追加。如果该文件已存在，文件指针将会放在文件的结尾。也就是说，新的内容将会被写入到已有内容之后。如果该文件不存在，创建新文件进行写入。
# ab	以二进制格式打开一个文件用于追加。如果该文件已存在，文件指针将会放在文件的结尾。也就是说，新的内容将会被写入到已有内容之后。如果该文件不存在，创建新文件进行写入。
# a+	打开一个文件用于读写。如果该文件已存在，文件指针将会放在文件的结尾。文件打开时会是追加模式。如果该文件不存在，创建新文件用于读写。
# ab+	以二进制格式打开一个文件用于追加。如果该文件已存在，文件指针将会放在文件的结尾。如果该文件不存在，创建新文件用于读写。
# foo = open("text.txt", 'w')	原有数据被清除
foo = open("text.txt",'a+')
foo.write("\n"+str)
# foo.write("\n请举起你的左手")
print("文件详细信息：")
# foo : <_io.TextIOWrapper name='text.txt' mode='w' encoding='cp936'>
for x in dir(foo):
	print(x)
foo.close()
foo = open("test.docx", "r+")
print(foo.__sizeof__())
# 读取
# for l in range(0,foo.__sizeof__()):
# 	# if l < foo.__sizeof__():
# 	# 	l += 48
# foo.encoding = 'gbk'
info = foo.read()
print(info)
